export const questions = [
  {
    number: '01',
    question: '둘 중 하나만 골라야 한다면?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '난 고독한 킬러...<br> 항상 선글라스를 끼고 모든 거래에 신중하지.',
        value: 'i',
      },
      {
        text: '나는야 유명한 현상금 사냥꾼!<br> 어떤 마을에 가도 날 알아보는 사람이 많지.',
        value: 'e',
      },
    ],
  },
  {
    number: '02',
    question:
      '주인공이 힘든 일을 겪고 상심에 빠져 있다. 당신이 작가라면 다음 시나리오는?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '(몇 년 후...) 아픔을 극복하고<br> 다시 평온을 찾은 모습을 보여준다.',
        value: 'i',
      },
      {
        text: '주인공 옆엔 항상 든든한 동료들이 있는 법.<br> 추억을 공유하고 함께 웃으며 금방 털어낸다.',
        value: 'e',
      },
    ],
  },
  {
    number: '03',
    question: '남자(여자) 주인공이 파티에 초대했다. 당신의 반응은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '이건 그린라이트야!<br> 어떤 옷을 입고 가야 잘 보일까?',
        value: 'e',
      },
      {
        text: '아직 그 정도로 친하지는 않은데...<br> 가도 어색하지 않으려나?',
        value: 'i',
      },
    ],
  },
  {
    number: '04',
    question: '당신의 드라마 시청 타입은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '내일 걱정은 내일!<br> 재밌으면 새벽까지 정주행한다.',
        value: 'p',
      },
      {
        text: '오랜만에 재미있는 드라마 발견!<br> 출근할 때나 자기 전, 하루에 한 편씩 본다.',
        value: 'j',
      },
    ],
  },
  {
    number: '05',
    question:
      '동료를 죽인 킬러의 부하를 물리치고 주소를 알아냈다. 주인공의 다음 행동은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '거짓 정보일 수도 있어 🔎️<br> 신속하게, 그러나 조용히 접근한다.',
        value: 'j',
      },
      {
        text: '지금 내 눈앞엔 복수뿐 🔫<br> 분노의 드라이브를 해 당장 찾아간다.',
        value: 'p',
      },
    ],
  },
  {
    number: '06',
    question: '당신의 드라마 타입은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '과학적이면서도 흥미진진하다!<br>상상력을 자극하는 SF 드라마',
        value: 'p',
      },
      { text: '이게 복선이었다고?<br> 디테일이 살아 있는 드라마', value: 'j' },
    ],
  },
  {
    number: '07',
    question: '목적지를 향해 가던 중, 의문의 사내를 만난다. 당신의 반응은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '빨리 가야 되는데...<br> 여기서 시간을 허비하면 늦게 될지도 몰라.',
        value: 's',
      },
      {
        text: '단서는 우연한 곳에서 발견하는 법!<br> 일단 따라가보자.',
        value: 'n',
      },
    ],
  },
  {
    number: '08',
    question: '드라마를 보고 난 뒤에 더 생각나는 것은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '촘촘하게 쓰인 각본의 퀄리티',
        value: 's',
      },
      { text: '마음을 울리는 주인공의 명대사', value: 'n' },
    ],
  },
  {
    number: '09',
    question: '당신이 선호하는 드라마 OST는?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '특유의 분위기를 잘 살려낸 인스트루멘탈',
        value: 's',
      },
      { text: '가사의 비유가 드라마와 잘 맞아 떨어지는 OST', value: 'n' },
    ],
  },
  {
    number: '10',
    question:
      '친구가 당신에게 드라마를 추천한다. 당신이 더 끌리는 친구의 추천은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '너랑 주인공이랑 닮은 모습이 많은 것 같아!',
        value: 'f',
      },
      {
        text: '해외에서 호평이야! <br>XX토마토 점수가 90점이 넘는대.',
        value: 't',
      },
    ],
  },
  {
    number: '11',
    question:
      '축구감독인 당신은 3:0으로 지고 있던 중 휴식 시간을 갖는다. 당신이 라커룸에서 선수들에게 할 말은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '경기 내내 안 좋은 모습을 보인 선수들에게<br> 어떻게 해야 하는지 피드백을 한다.',
        value: 't',
      },
      {
        text: '이기면 휴가다! 세세한 피드백보다<br>선수들에게 동기부여를 심어준다.',
        value: 'f',
      },
    ],
  },
  {
    number: '12',
    question:
      '축구감독인 당신은 3:0으로 지고 있던 중 휴식 시간을 갖는다. 당신이 라커룸에서 선수들에게 할 말은?',
    imageURL: 'https://www.entoin.com/images/minfp5.jpg',
    choices: [
      {
        text: '정 때문에 사람에게 배신 당하지만 <br>반대로 나를 도와주는 사람도 많음',
        value: 'f',
      },
      {
        text: '감정은 메말랐지만 특유의 분석력으로<br>사건을 해결함',
        value: 't',
      },
    ],
  },
];

export const results = [
  {
    mbti: 'entj',
    title: '시련에 굴하지 않아! 선천적 리더형',
    mainCharacter: '크루엘라(크루엘라)',
    subCharacter: ['하비 스펙터(수츠)', '팔론 캐링턴(다이너스티)'],
    goodChemistry: ['셜록 홈즈(셜록)', '루크 스카이워커(스타워즈)'],
    results: [
      '나를 따르라!<br>특유의 카리스마와 자신감으로 리더에 어울리는 인물입니다.',
      '내 앞에 불가능은 없다!<br>어려운 상황에 굴하지 않고 뛰어난 실행력으로 결국 성공을 쟁취합니다.',
      '정말 친한 사람이 아니면 감정을 잘 드러내지 않습니다.<br>가끔은 자기 자신의 감정을 모를 때도 있어요.',
    ],
  },
  {
    mbti: 'entp',
    title: '대사는 내가 책임질게! 직설 유머러스형',
    mainCharacter: '바니 스틴슨(내가 그녀를 만났을 때)',
    subCharacter: ['챈들러 빙(프렌즈)', '지미 맥길(사울 굿맨)'],
    goodChemistry: ['제임스(빌어먹을 세상따위)', '웬즈데이 아담스(웬즈데이)'],
    results: [
      '속으로만 생각하는 일이 없어요. 해야 할 말은 꼭 하는 편이에요.',
      '화려한 것을 좋아하고 특유의 유머러스함을 가진 매력적인 인물이에요.',
      '주변의 눈치를 보지 않고 내키지 않고 행동하는 거침없는 면모가 있어요.',
    ],
  },
  {
    mbti: 'estp',
    title: '인생은 곧 모험! 열정 모험가형',
    mainCharacter: '엘리너 셸스트롭(굿 플레이스)',
    subCharacter: ['데이먼 살바토레(뱀파이어 다이어리)', '맥스(기묘한 이야기)'],
    goodChemistry: ['왓슨 박사(셜록)', '에이미 산티아고(브루클린 나인 나인)'],
    results: [
      '이들은 말보다 행동이 앞서는 열정적인 인물입니다.',
      '규칙에 얽매이는 지루한 수업보다는 발로 뛰는 것을 좋아합니다.',
      '사소한 변화도 감지하는 촉이 있어 이들 앞에서는 거짓말을 숨기기 쉽지 않죠.',
    ],
  },
  {
    mbti: 'esfp',
    title: '나랑 같이 있으면 재미있을 걸? 자유로운 영혼형',
    mainCharacter: '도쿄(종이의 집)',
    subCharacter: ['제시 핑크맨(브레이킹 베드)', '알리사(빌어먹을 세상 따위)'],
    goodChemistry: ['팸 비즐리(더 오피스)', '로스 겔러(프렌즈)'],
    results: [
      '낙천적이고 단순한 성격은 사람들의 호감을 불러 일으킵니다.',
      '따뜻하고 열정적이며 자신의 열정에 매우 솔직한 캐릭터에요.',
      '결혼식날 도망쳐 나오거나 모르는 타인과 여행을 떠나는 것처럼<br> 매우 즉흥적이고 충동적인 면도 있습니다.',
    ],
  },
  {
    mbti: 'esfj',
    title: '내가 하는 일은 모두 완벽해야 해! 전교회장형',
    mainCharacter: '에밀리 쿠퍼(에밀리, 파리에 가다)',
    subCharacter: [
      '레슬리 노프(팍스 앤 레크리에이션)',
      '다프네 브리저튼(브리저튼)',
    ],
    goodChemistry: ['에피(스킨스)', '루 베넷(유포리아)'],
    results: [
      '실용적이고 현실적인 성격을 가진 당신은 <br>동료가 갈팡질팡할 때 훌륭한 조언을 던져주기도 하죠.',
      '의사결정에 있어 매우 빠르고 결단력 있는 사람이기에<br> 조직을 거느릴 줄 알고 항상 최상의 결과를 얻기 위해 노력합니다.',
      '때로는 집착적인 모습을 보이기도 하지만<br> 이마저도 사랑스럽게 느껴지는 캐릭터에요.',
    ],
  },
  {
    mbti: 'estj',
    title: '복잡하고 어려운 일은 나에게 맡겨! 엄격한 능력자형',
    mainCharacter: '헤르미온느(해리포터)',
    subCharacter: ['드와이트 슈르트(더 오피스)', '모니카 겔러(프렌즈)'],
    goodChemistry: ['에피(스킨스)', '루 베넷(유포리아)'],
    results: [
      '정직과 헌신의 아이콘!<br>자신의 가치관을 지키고자 노력하는 사람입니다.',
      '드라마 안에서 경영인으로 나올 때가 많습니다.<br>이들은 노력으로 권위를 쟁취하길 바라기 때문이죠.',
      '자신에 대한 믿음이 강해 때로는 답답한 면모를 보이기도 하지만<br> 누구도 나서려 하지 않는 어려운 일을 나서서 하는 성격입니다.',
    ],
  },
  {
    mbti: 'enfj',
    title: '보고 있으면 행복해지는, 정의로운 협동가형',
    mainCharacter: '엠마 우드하우스(엠마)',
    subCharacter: [
      '테리 제포즈(브루클린 나인 나인)',
      '마이크 윌러(기묘한 이야기)',
    ],
    goodChemistry: ['루크 스카이워커(스타워즈)', '에피(스킨스)'],
    results: [
      '늘 사려 깊고 때로는 이상주의적인 태도를 보입니다.<br>어려운 상황에서도 늘 올바른 길을 찾으려고 하죠.',
      "이들이 중요시하는 것은 '진실함'입니다.<br>또한 이타주의적인 성격을 갖고 있어 남을 돕고자 하는 세심함을 갖추고 있죠.",
      '권력보다는 진실! 갈등이 있을 때 소통으로 상황을 해결하고자 하는<br>배려심 넘치는 인물입니다.',
    ],
  },
  {
    mbti: 'infp',
    title: '눈빛만 봐도 빠져든다... 우수에 찬 로맨틱형',
    mainCharacter: '루크 스카이워커(스타워즈)',
    subCharacter: ['캐시(스킨스)', '윌 바이어스(기묘한 이야기)'],
    goodChemistry: ['크루엘라(크루엘라)', '엠마 우드하우스(엠마)'],
    results: [
      '겉으론 우울하고 슬퍼보이지만 속은 생각보다 단단한 경우가 많아요.',
      '세상을 이분법적으로 바라보지 않아 남들보다 더 힘들어하기도 해요.',
      '내면에 믿음과 신념에 대한 열정을 늘 품고 살아요.',
    ],
  },
  {
    mbti: 'isfp',
    title: '많은 팬들을 마음앓이하게 만드는 성장물 주인공형',
    mainCharacter: '에피(스킨스)',
    subCharacter: ['일레븐(기묘한 이야기)', '해리포터(해리포터)'],
    goodChemistry: [
      '엠마 우드하우스(엠마)',
      '에밀리 쿠퍼(에밀리, 파리에 가다)',
    ],
    results: [
      '어딘가 아픈 구석이 있지만 남들 눈에는 잘 극복하고 사는 듯 보입니다.',
      '인내심이 많고 마음씨가 따뜻해 성장물의 주인공인 경우가 많아요.',
      '냉정과 열정을 함께 지닌 매력적인 인물이죠!',
    ],
  },
  {
    mbti: 'isfj',
    title: '내가 있어 든든하지? 듬직한 조력자형',
    mainCharacter: '팸 비즐리(더 오피스)',
    subCharacter: ['왓슨 박사(셜록)', '레너드(빅뱅 이론)'],
    goodChemistry: ['도쿄(종이의 집)', '엘리너 셸스트롭(굿 플레이스)'],
    results: [
      '근면성실의 아이콘! 주인공을 뒤에서 묵묵히 돕고 헌신하는 역할을 합니다.',
      '대인관계가 뛰어나 모든 사람들의 사랑을 받는 캐릭터죠.',
      '악에 맞서 가족과 연인, 친구를 지키는 든든한 역할이 많아요.',
    ],
  },
  {
    mbti: 'infj',
    title: '묘한 매력을 가진, 내적 갈등형',
    mainCharacter: '제임스(빌어먹을 세상따위)',
    subCharacter: [
      '테드 모스비(내가 그녀를 만났을 때)',
      '대너리스 타르가르옌(왕자의 게임)',
    ],
    goodChemistry: [
      '에니드 싱클레어(웬즈데이)',
      '바니 스틴슨(내가 그녀를 만났을 때)',
    ],
    results: [
      '자신이 생각하는 선을 지키고자 항상 노력해요.',
      '완벽하기를 원하며 자신이 옳다고 생각하는 일에는 진심을 다하는 편입니다.',
      '주인공인 경우 인생의 목표를 찾으러 고행을 떠나기도 합니다.',
    ],
  },
  {
    mbti: 'istp',
    title: '액션도 로맨스도 주인공은 나의 몫!',
    mainCharacter: '루 베넷(유포리아)',
    subCharacter: [
      '로사 디아즈(브루클린 나인 나인)',
      '로빈 셔바츠키(내가 그녀를 만났을 때)',
    ],
    goodChemistry: ['에밀리 쿠퍼(에밀리, 파리에 가다)', '헤르미온느(해리포터)'],
    results: [
      '세상에 대한 탐구심이 많은 당신! 어려운 상황도 척척 풀어나갑니다.',
      '상황에 대한 적응력이 뛰어나요.',
      '말괄량이 같아 보이는 반면 특유의 차분함을 가진 매력적인 성격이라<br>액션 영화나 로맨스물의 주인공인 경우가 많아요.',
    ],
  },
  {
    mbti: 'intj',
    title: '외롭지만 어쩌겠어. 고독한 전략가형',
    mainCharacter: '웬즈데이 아담스(웬즈데이)',
    subCharacter: ['베스 하먼(퀸즈 갬빗)', '월터 화이트(브레이킹 베드)'],
    goodChemistry: [
      '바니 스틴슨(내가 그녀를 만났을 때)',
      '에니드 싱클레어(웬즈데이)',
    ],
    results: [
      '왜 사람들은 나를 이해하지 못할까?<br>이성적이면서도 두뇌 회전이 빨라 비범한 면모를 보입니다.',
      '마이웨이적인 성격이 강하고 모든 것에 의문을 가져<br>남들의 말을 쉽게 믿지 않는 타입입니다.',
      '독립적인 성격으로 남에게 쉽게 도움을 요청하지 않아요.<br>비범한 천재이거나 고독한 악역인 경우가 많아요.',
    ],
  },
  {
    mbti: 'intp',
    title: '조금은 이상하지만 똑똑한 괴짜 천재형',
    mainCharacter: '셜록 홈즈(셜록)',
    subCharacter: [
      '우영우(이상한 변호사 우영우)',
      '치디 아나곤예(굿 플레이스)',
    ],
    goodChemistry: ['크루엘라(크루엘라)', '헤르미온느(해리포터)'],
    results: [
      '지적인 매력을 지닌 당신! 직관적이고 논리적이며 통찰력이 뛰어납니다.<br>은근 수다스럽고 승부욕도 강하죠.',
      '매사에 호불호가 뚜렷하고 특정 분야에 대한<br>관심과 애정을 지니고 있을 확률이 높습니다.',
      '천재적인 기지를 발휘해 모두가 답답해할 때 훌륭한 해결책을 내세워<br>상황을 단번에 해결하는 해결사의 면모를 지니고 있죠.',
    ],
  },
  {
    mbti: 'istj',
    title: '빛과 소금 같은 존재! 든든한 조력자형',
    mainCharacter: '에이미 산티아고(브루클린 나인 나인)',
    subCharacter: ['로스 겔러(프렌즈)', '셸든 쿠퍼(빅뱅 이론)'],
    goodChemistry: ['도쿄(종이의 집)', '엘리너 셸스트롭(굿 플레이스)'],
    results: [
      '자신이 하는 일에 굉장한 자부심을 느끼는 당신!<br>일이나 가족, 그 무엇이든 헌신하는 모습을 보입니다.',
      '다른 사람들의 주의를 끄는 일에는 관심이 없고,<br> 스트레스가 극심한 상황에서도 현실적이고 논리적인 태도를 유지합니다.',
      '남들보다 책임강이 강해서<br> 어떠한 일이 있어도 자신의 의무를 지키려는 성향이 있습니다.',
    ],
  },
  {
    mbti: 'enfp',
    title: '나랑 친구하지 않을래? 명랑 사교형',
    mainCharacter: '에니드 싱클레어(웬즈데이)',
    subCharacter: ['피비 부페이(프렌즈)', '마이클 스콧(더 오피스)'],
    goodChemistry: ['제임스(빌어먹을 세상따위)', '웬즈데이 아담스(웬즈데이)'],
    results: [
      '솔직하고 직선적인 당신은 대표적인 돌I형 캐릭터로 명랑하고 맑은 이미지를 갖고 있어요.',
      '돌려말해야 할 때도 직선적으로 내뱉어 우스꽝스러운 상황을 연출하기도 하죠.',
      '마음이 따뜻하고 다른 사람에게 늘 도움이 되고자 노력하는 성격이기에<br>사랑하지 않을 수 없는 캐릭터입니다.',
    ],
  },
];

export const mbtis = {
  entj: 0,
  entp: 1,
  estp: 2,
  esfp: 3,
  esfj: 4,
  estj: 5,
  enfj: 6,
  infp: 7,
  isfp: 8,
  isfj: 9,
  infj: 10,
  istp: 11,
  intj: 12,
  intp: 13,
  istj: 14,
  enfp: 15,
};
